# Details
Name - Utkarsh Mathur
Student ID - x19232977
Master of Science in Data Analytics
National College Of Ireland

# Importing necessary libraries

In [ ]:
from bs4 import BeautifulSoup as bs
import requests
import json
import pandas as pd
import pymongo
from pymongo import MongoClient
import pyodbc
import numpy as np
import plotly.express as plt

# HTML links for doing web-scrapping

In [2]:
Links = pd.read_csv("file_path", header = None)
Links = list(Links[0])
Links.remove('Links')

In [3]:
Links
print(len(list(Links)))

# Using Beautiful Soup and saving data in List as json

In [4]:
Result = []
for Link in Links:
    print (Link)
    r = requests.get(Link)
    soup = bs(r.content, "html.parser")
    type(soup)
    data_dict={"City":[],"Places":[],"Address":[],"Website":[],"Phone":[],"Reviews":[],"Rating (Out of 5)":[]}
    title_elem = soup.find('h1',class_='ui_header h1')
    print (title_elem.text)
    data_dict["Places"]=(title_elem.text.strip())
    address_elem = soup.find('div',class_='LjCWTZdN')
    data_dict["Address"]=(address_elem.text.strip())
    website_elem = soup.find('div',class_='_1ev9TQ-P')
    data_dict["Website"]=(website_elem.a['href'])
    phone_elem = soup.find('a',class_='_TF8HH3_')
    data_dict["Phone"]=(phone_elem.text.strip())
    Review_elem = soup.find('div',class_='_1NKYRldB')
    data_dict["Reviews"]=(Review_elem.text.strip())
    City_elem = soup.find('div',class_='eQSJNhO6')
    City = City_elem.text.strip()
    data_dict["City"]=(City.split(" ",7)[-1])
    Rating_elem = soup.find('a',class_='_1d_R5B7y')
    try:
        data_dict["Rating (Out of 5)"]=(Rating_elem.text.strip())
    except:
        data_dict["Rating (Out of 5)"]=(Rating_elem)
    Result.append(data_dict)
    
final=pd.DataFrame().from_dict(Result)

In [ ]:
final

# Connecting to MongoDB and pushing json file as collection

In [13]:
client = pymongo.MongoClient("mongodb+srv://dapGroup1:dapGroup123@tourism.wurzf.mongodb.net/myFirstDatabase?retryWrites=true&w=majority")
db = client['tourism']
col = db['attractions']
mongo_dataset = col.insert_many(final.to_dict('records'))
mongo_dataset

# Fetching data from MongoDB as Dataframe for pre-processing

In [8]:
df = pd.DataFrame(list(col.find()))
df

# Cleaning of Data

In [11]:
df1 = df["Reviews"].str.split(" ", n = 1 , expand = True)
df["Review"] = df1[0]
df["Text"] = df1[1]
df.rename(columns={"Rating (Out of 5)":"Ratings"}, inplace=True)
df["Review"] = df["Review"].str.replace(",","").astype(int)
df.drop(['_id' , 'Reviews' , 'Text'], axis='columns', inplace=True)
df

# Inserting Processed Data to SQL

In [71]:
server = 'tcp:dapgroup1.database.windows.net'
database = 'dap' 
username = 'dap' 
password = 'Admin@123' 
cnxn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password)
cursor = cnxn.cursor()
cursor.execute('''DROP TABLE dbo.Attractions''')
cursor.execute('''CREATE TABLE attractions (City nvarchar(200) , Places nvarchar(200) , Address nvarchar(200) , Website nvarchar(200), Phone nvarchar(200) , Ratings nvarchar(200) , Review int)''')
for index, row in df.iterrows():
    cursor.execute("INSERT INTO attractions (City,Places,Address,Website,Phone,Ratings,Review) values(?,?,?,?,?,?,?)", row.City, row.Places, row.Address, row.Website, row.Phone, row.Ratings, row.Review)
cnxn.commit()
cursor.close()

# Performing SQL Query on Data in Azure SQL DB

In [108]:
server = 'tcp:dapgroup1.database.windows.net'
database = 'dap' 
username = 'dap' 
password = 'Admin@123' 
cnxn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password)
output_df = pd.DataFrame(pd.read_sql("SELECT City,Avg(Review) as Avg_Review from dbo.attractions GROUP By City", cnxn))
output_df

                  City  Avg_Review
0            Amsterdam       17777
1     Auckland Central        3026
2              Bangkok       10692
3               Berlin       12205
4             Brisbane        2582
5             Brooklyn        2906
6                Dubai       16554
7               Dublin       10403
8            Hong Kong        7953
9             Istanbul       13157
10           Kathmandu        1359
11  Kolkata (Calcutta)        1068
12         Kuwait City         617
13              London       25107
14         Los Angeles        6403
15              Madrid       14254
16        Marrickville          24
17           Melbourne        5088
18         Mexico City        4886
19              Muscat         619
20       New York City       41124
21       Niagara Falls        6078
22               Paris       27777
23               Perth        1544
24         Puerto Rico        4140
25              Riyadh         550
26            Santiago        7027
27           Sao Paulo        6569
28             Seattle        7226
29               Seoul        3304
30            Shanghai        2202
31           Singapore       12854
32           Stockholm        7474
33              Sydney        7177
34             Toronto        7690
35           Vancouver        5276
36              Zurich        1806

# Visualizing the Data using Plotly

In [1]:
fig = plt.bar(output_df, y='Avg_Review', x='City',
             labels={'Avg_Review': 'Avg Review', 'City': 'city'})
fig.show()

# Combining the two dataset (flight and city attractions) for insight

In [3]:
database_result = pd.read_sql("select Distinct aa.* from flights_detail fd INNER JOIN cities_countries cc on fd.arrival_city_id=cc.city_id INNER JOIN Attractions aa on aa.City=cc.city where flight_status='landed' ORDER by Review DESC", cnxn)
database_result

# Combining all three datasets for final insight and analysis

In [20]:
server = 'tcp:dapgroup1.database.windows.net'
database = 'dap' 
username = 'dap' 
password = 'Admin@123' 
cnxn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password)
output_df = pd.DataFrame(pd.read_sql("SELECT Review,Places,City from dbo.attractions where City in (select Top 1 cli.City from flights_detail fd inner join cities_countries cc on fd.arrival_city_id=cc.city_id INNER JOIN dbo.city_living_index cli on cc.city=cli.City INNER JOIN dbo.attractions aa on aa.City=cc.city where flight_status='scheduled' GROUP by cli.city, flight_status order by AVG([Rent Index]) ASC) and Ratings is not null order by Review Desc", cnxn))
output_df

   Review                     Places       City
0    6202       Swayambhunath Temple  Kathmandu
1    4022           Garden of Dreams  Kathmandu
2     787            Kopan Monastery  Kathmandu
3     398          Chandragiri Hills  Kathmandu
4     236         Dakshinkali Temple  Kathmandu
5     139  Jaganath (Krishna) Temple  Kathmandu
6     112        Kailashnath Mahadev  Kathmandu
7      90        The National Museum  Kathmandu

In [2]:
result_df = pd.read_sql(
    "select Review,Places,City from attractions where City in (select Top 1 cli.City from flights_detail fd inner join cities_countries cc on fd.arrival_city_id=cc.city_id INNER JOIN city_living_index cli on cc.city=cli.City INNER JOIN attractions aa on aa.City=cc.city where flight_status='scheduled' GROUP by cli.city, flight_status order by AVG([Rent Index]) ASC) and Ratings is not null order by Review Desc",
    con=cnxn)
city = result_df['City'].iloc[0]
fig = plt.pie(result_df, values='Review', names='Places',
             labels={'Places': 'Places', 'Review': 'Review'}, title='Top 10 Places and reviews in ' + city)
fig.show()